app/controllers/api/memes_controller.rb

		def index
			@memes = Meme.all
---
SELECT `memes`.* FROM `memes`

		def show
			@memes = Meme.find(params[:id])
---
SELECT `memes`.* FROM `memes` WHERE `memes`.`id` = 3 LIMIT 1