app/controllers/api/topics_controller.rb

		def index
			@topic = Topic.all
---
SELECT `topics`.* FROM `topics`