app/controllers/memes_controller.rb

  def show
  	@topic = Topic.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1

  def update
  	@memes= Meme.find(params[:id])

  	if params[:flag] == 'yes'
  		likes = 1+@memes.likes
  		@memes.update_attributes(:likes => likes)
---
SELECT `memes`.* FROM `memes` WHERE `memes`.`id` = 1 LIMIT 1
UPDATE `memes` SET `dislikes` = 1, `updated_at` = '2015-03-25 19:55:00' WHERE `memes`.`id` = 18